In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({
    "Column1":[1,2,3,4,5,6],
    "Column2":[100,100,200,300,300,100],
    "Column3":["Mustafa","Kamil","Emre","Ayşe","Murat","Zeynep"]
})

In [4]:
df

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre
3        4      300     Ayşe
4        5      300    Murat
5        6      100   Zeynep

In [6]:
df.head() #değer girilmeyince ilk 5 değeri döndürür.

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre
3        4      300     Ayşe
4        5      300    Murat

In [7]:
df.head(3)

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre

In [8]:
df["Column2"].unique()  ## Kaç farklı değer olduğunu bulmak için

array([100, 200, 300], dtype=int64)

In [10]:
df["Column2"].nunique()

3

In [12]:
df["Column2"].value_counts()

100    3
300    2
200    1
Name: Column2, dtype: int64

In [13]:
df[df["Column1"] >= 4]

   Column1  Column2 Column3
3        4      300    Ayşe
4        5      300   Murat
5        6      100  Zeynep

In [14]:
df[(df["Column1"] >= 4) & (df["Column2"] == 300)]

   Column1  Column2 Column3
3        4      300    Ayşe
4        5      300   Murat

In [15]:
df

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre
3        4      300     Ayşe
4        5      300    Murat
5        6      100   Zeynep

In [16]:
def times3(x):
    return x*3

In [18]:
times3(6)

18

In [19]:
df["Column2"]

0    100
1    100
2    200
3    300
4    300
5    100
Name: Column2, dtype: int64

In [20]:
df["Column2"].apply(times3)

0    300
1    300
2    600
3    900
4    900
5    300
Name: Column2, dtype: int64

In [21]:
df["Column2"] = df["Column2"].apply(times3)

In [22]:
df

   Column1  Column2  Column3
0        1      300  Mustafa
1        2      300    Kamil
2        3      600     Emre
3        4      900     Ayşe
4        5      900    Murat
5        6      300   Zeynep

In [23]:
lambda x : x*2

In [24]:
murat = lambda x:x*2

In [25]:
murat(6)

12

In [26]:
df

   Column1  Column2  Column3
0        1      300  Mustafa
1        2      300    Kamil
2        3      600     Emre
3        4      900     Ayşe
4        5      900    Murat
5        6      300   Zeynep

In [27]:
df["Column2"].apply(lambda x : x * 2)

0     600
1     600
2    1200
3    1800
4    1800
5     600
Name: Column2, dtype: int64

In [28]:
df["Column3"]

0    Mustafa
1      Kamil
2       Emre
3       Ayşe
4      Murat
5     Zeynep
Name: Column3, dtype: object

In [29]:
df["Column3"].apply(len)

0    7
1    5
2    4
3    4
4    5
5    6
Name: Column3, dtype: int64

In [30]:
df

   Column1  Column2  Column3
0        1      300  Mustafa
1        2      300    Kamil
2        3      600     Emre
3        4      900     Ayşe
4        5      900    Murat
5        6      300   Zeynep

In [32]:
df.drop("Column3", axis=1)

   Column1  Column2
0        1      300
1        2      300
2        3      600
3        4      900
4        5      900
5        6      300

In [33]:
df

   Column1  Column2  Column3
0        1      300  Mustafa
1        2      300    Kamil
2        3      600     Emre
3        4      900     Ayşe
4        5      900    Murat
5        6      300   Zeynep

In [34]:
df.drop("Column3", axis=1, inplace=True)

In [35]:
df

   Column1  Column2
0        1      300
1        2      300
2        3      600
3        4      900
4        5      900
5        6      300

In [36]:
df.columns

Index(['Column1', 'Column2'], dtype='object')

In [37]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [38]:
len(df.index)

6

In [39]:
df.index.names

FrozenList([None])

In [40]:
df

   Column1  Column2
0        1      300
1        2      300
2        3      600
3        4      900
4        5      900
5        6      300

In [41]:
df.sort_values("Column2")

   Column1  Column2
0        1      300
1        2      300
5        6      300
2        3      600
3        4      900
4        5      900

In [42]:
df.sort_values("Column2", ascending=False)

   Column1  Column2
3        4      900
4        5      900
2        3      600
0        1      300
1        2      300
5        6      300

In [43]:
df = pd.DataFrame({
    "Ay" : ["Mart","Nisan","Mayıs","Mart","Nisan","Mayıs","Mart","Nisan","Mayıs"],
    "Şehir":["Ankara","Ankara","Ankara","İstanbul","İstanbul","İstanbul","İzmir","İzmir","İzmir"],
    "Nem":[10,25,50,21,67,80,30,70,75]
})

In [44]:
df

      Ay     Şehir  Nem
0   Mart    Ankara   10
1  Nisan    Ankara   25
2  Mayıs    Ankara   50
3   Mart  İstanbul   21
4  Nisan  İstanbul   67
5  Mayıs  İstanbul   80
6   Mart     İzmir   30
7  Nisan     İzmir   70
8  Mayıs     İzmir   75

In [46]:
df.pivot_table(index = "Ay", columns = "Şehir" , values = "Nem")

Şehir  Ankara  İstanbul  İzmir
Ay
Mart       10        21     30
Mayıs      50        80     75
Nisan      25        67     70

In [47]:
df.pivot_table(index = "Şehir", columns = "Ay" , values = "Nem")

Ay        Mart  Mayıs  Nisan
Şehir
Ankara      10     50     25
İstanbul    21     80     67
İzmir       30     75     70

In [48]:
df

      Ay     Şehir  Nem
0   Mart    Ankara   10
1  Nisan    Ankara   25
2  Mayıs    Ankara   50
3   Mart  İstanbul   21
4  Nisan  İstanbul   67
5  Mayıs  İstanbul   80
6   Mart     İzmir   30
7  Nisan     İzmir   70
8  Mayıs     İzmir   75